API -> teknik/sesuatu yang membuat 2 sistem terhubung

- pertukaran data
    - request -> permintaan (user) untuk mengakses data
        * http function
        * url / alamat
        * body (function POST, PUT, DELETE) optional
            - payload request -> json
        * headers
            - configuration
            - additional information
    - response -> data yang dikirimkan karena adanya request
        * body
            - data yang dikembalikan -> json
        * headers
            - configuration
            - additional information

In [5]:
import pandas as pd

df = pd.read_csv('datasets.csv')
df

    nama  age location
0  anton   24  jakarta
1   lina   20    ambon
2   kuna   56   manado
3   giri   14   maluku
4  dimas   20   bekasi
5  santo   31   padang
6    ryu   45  bandung

In [6]:
df.loc[7] = ['ani', 31, 'kutai']
df

    nama  age location
0  anton   24  jakarta
1   lina   20    ambon
2   kuna   56   manado
3   giri   14   maluku
4  dimas   20   bekasi
5  santo   31   padang
6    ryu   45  bandung
7    ani   31    kutai

In [8]:
r = df[df['nama'] == 'rika']
r.size

0